{"testimonials":[{"name":"Kyla","message":"Your insights and grace were a true gift. Thank you for creating a space that allowed me to explore and for your gentle guidance.","snippet":"Your insights and grace were a true gift. Thank you for creating a space that allowed me to explore and for your gentle guidance","category":"individual"},{"name":"Corina","message":"Deb has helped me to take action steps towards self-discovery and accomplishment, getting to know better my true self, and to recognize and work with my thoughts to align them with the True Self. I lost 23 pounds so far and it has been 6 months since I quit eating pork and beef (yeee-haaa). Also this coaching has been helping me to understand better the actions of people around me, and I’m improving my love-relationship by looking at things from a better perspective","snippet":"Deb helped me to recognize and work with my thoughts to align them with the True Self. I lost 23 pounds so far","category":"individual"},{"name":"Peter","message":"Deb’s coaching helped me focus and think about the things in my life that were holding me back from achieving my dream of getting my ideas out into the universe. During and after her sessions I feel I learned a great deal about myself and about how the universal laws work for us all… Deb’s coaching is more than worth the investment in yourself.","snippet":"Deb’s coaching is more than worth the investment in yourself","category":"individual"},{"name":"Gail","message":" Before I met Deb Jones, I was fearful and mistrusting. Yet, in just 2-4 weeks, Deb guided me through monumental changes, allowing me to stop anxiety and fear producing behaviors, get out of my head, care for and trust others, and begin living instead of floundering through my existence. She gave me tools to avoid old habitual behaviors and free myself from my negative self-talk. She intuitively worked with me, helping me to find the strength that resides within me and resources to maintain a positive energy flow. These changes will last the rest of my life as I no longer feel imprisoned.","snippet":"I found the strength that resides within me... These changes will last the rest of my life as I no longer feel imprisoned","category":"individual"},{"name":"Misiker","message":"Deb’s coaching is a meaningful relationship that’s based on trust in who you are and what you have to offer in your arsenal of gifts. My favorite exercise was when you asked repeatedly at the beginning of our 1:1 session “who are you”?,  I don’t think anyone has ever asked me that in a way that you did, provoking an introspective quest for self-awareness from the core. Just being able to vocalize who I genuinely believed I was with honesty was an awesome exercise. Whether the conclusion of who I thought I was, was good, bad or indifferent didn’t matter so much as the realization and confession of it. This awakening inspired me to strive to become a better, realer and more grounded me than the futile attempt to create a persona to appeal to my environment.","snippet":"this awakening inspired me to strive to become a better, realer and more grounded me","category":"individual"},{"name":"Brianna","message":"You truly care about the person you are coaching, you make me feel comfortable an able to express my true feelings, fears, and let me get excited about my accomplishments.","snippet":"you make me feel comfortable an able to express my true feelings, fears, and let me get excited about my accomplishments.","category":"individual"},{"name":"Kaitlyn","message":"We had an instance where our team was not communicating well and it was causing a lot of tension between workers. We got together for a group coaching session so that everyone could communicate their concerns in an environment where we were encouraged to speak freely. By taking the time to sit down and have a coaching session we are now able to work better as a team. It has personally impacted me by how I notice and understand each of my coworkers individually which in turn helps me know how to communicate and work with them more effectively.","snippet":"how I notice and understand each of my coworkersin turn helps me know how to communicate and work with them more effectively.","category":"team"},{"name":"Kristy's supervisor","message":"Kristy was one of our senior team members and we did not want to lose her, but her work ethic and soured attitude made the path forward difficult. We all knew there was a lot of potential in Kristy and we just needed to get past whatever barrier was holding us back. Because it was clear that none of us on the team were equipped to break that barrier, we turned to Deb’s help to try and get Kristy back on track. After one coaching session, Jennifer’s work efficiencies turned around. She was no longer timid or afraid to admit faults or mistakes, and was always eager to ask questions and accept criticism. She became a leader figure in team exercises and has become a calm and assertive pillar within our team. This month we recognized Kristy as our Team Member of the Month for her great attitude, her role as a partner to others, and her willingness to communicate concerns and problems.    Prior to Deb’s involvement I would not have imagined this result would have been achievable. Deb’s guidance simply helped Kristy to recognize and utilize her potential and skills. Allowing people to believe in themselves and appreciate their capacity in the workplace is extremely valuable and powerful, and for that I am extremely grateful to Deb.","snippet":"Allowing people to believe in themselves and appreciate their capacity in the workplace is extremely valuable and powerful","category":"team"},{"name":"Gail","message":"With Deb as our guide, I have found success and nurturing in my work environment in a way that I have never experienced in the 25 years of being in the workforce. I come to work to feel the connections with my co-workers and to produce quality work, which helps the people I work with to radiate the same nurturing energy to people they come in contact with. This observable ripple effect has affected the entire workplace and continues to radiate out into the world. I love coming to work for the first time. I have thrived under her tough, deep questioning and unconditional love. I feel the day we met was the most fortuitous of my life. Deb truly is the “People Whisperer”.","snippet":"I love coming to work for the first time...the day we met was the most fortuitous of my life. Deb truly is the “People Whisperer”","category":"team"},{"name":"Bryce","message":"Deb helped our crew make a great positive shift. Deb’s coaching provides a safe atmosphere to allow co-workers as well as those in charge, to discuss and solve problems at work. My first experience with the coaching experience was great, and later I participated in another coaching experience with my crew. Both times I left feeling better, and I believe most other members of the crew did too. The crew seemed to work better together following the coaching. We are more unified, more together, and this is something all companies hope for.","snippet":"We are more unified, more together, and this is something all companies hope for","category":"team"},{"name":"Misiker","message":"I would classify your style of coaching as thoughtful/mindful of its audience and the circumstances at a personal/organizational level; perhaps this can be attributed to your training and experience as well as your innate strengths in the area of individualization. I also love your communication style and your level of empathy. I recognize the impact of your service to make individuals and teams become better at how we go about doing our work on the job and carry an improved life outlook as an enormous benefit to our well-being. As someone who’s witnessed and personally experienced the value of your coaching, I know, without a doubt, many teams and leaders can benefit from it as well.","snippet":"I know, without a doubt, many teams and leaders can benefit from Deb's coaching","category":"team"},{"name":"Brianna","message":"100% excitement to work with someone who has ‘life coach’ experience; thought it would be very useful to promote self awareness in myself and my team.","snippet":"100% excitement to work with someone who has ‘life coach’ experience","category":"team"},{"name":"Diana","message":"The team coachings have helped a lot because when working with other people there is bound to be problems. In our group, we’ve had situations where if we hadn’t had a team meeting things would have ended badly or people would have not stayed here because of unresolved issues. Thanks to Deb’s coaching our lab has an amazing positive vibe and we have all learned to work together and grow more and more in life.","snippet":"Thanks to Deb’s coaching our lab has an amazing positive vibe...we have all learned to grow more and more in life","category":"team"},{"name":"Tara","message":"Developing and maintaining a team and, quite frankly, “liking” the people you work with can bechallenging. Because of Deb’s coaching I come to work and know that people care about me and support me. This supportive atmosphere has increased our productivity tremendously and I have watched it expand into other groups. Without this time we spend working on ourselves, and creating this cohesiveness between our coworkers, we wouldn’t be as productive, I probably wouldn’t work here, and my co-workers and I would not grow as individuals in society.","snippet":"I come to work and know that people care about me and support me. This supportive atmosphere has increased our productivity tremendously","category":"team"},{"name":"Coltin","message":"After Deb came everyone had everyone’s backs. Everyone worked as a team and got a lot done and everyone enjoyed coming to work. Her coaching has helped me make some healthy life decisions. It helped me feel more at peace with others and myself throughout the week. It taught me many things I didn’t know about myself.","snippet":" It helped me feel more at peace with others and myself","category":"team"},{"name":"Karlie","message":"Deb’s team coaching has not only helped me reach professional and personal goals but the meetings have also helped our entire team become more efficient and productive. The group meetings help resolve social and work issues before they continue to progress into an actual problem. I actually look forward to returning to work each and every single day. I have seen productivity increase among my own co-workers in other teams as well.","snippet":"I actually look forward to returning to work each and every single day. I have seen productivity increase","category":"team"},{"name":"Joy","message":"I enjoyed the entire interaction from start to finish, even if I may have discovered a couple of slightly uncomfortable things about myself (very much worth it— allowed me to connect additional dots). My favorite part of it was how unusual your approach is compared with what I typically encounter in our company.","snippet":"My favorite part of it was how unusual your approach is compared with what I typically encounter in our company","category":"team"}]}